rocksdb/experiments/M2/results/20260429-055153-budget-sensitivity/bmin_2_ptarget_0/budget_on/run_1/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 05:54:16 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777442056804209 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       8.693 micros/op 115038 ops/sec 43.464 seconds 5000000 operations;  114.1 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      13.585 micros/op 73612 ops/sec 67.924 seconds 5000000 operations;   73.0 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      10.911 micros/op 91654 ops/sec 54.553 seconds 5000000 operations;   90.9 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0     14/0   871.90 MB   3.5      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    394.7     37.88             26.06       240    0.158       0      0       0.0       0.0
  L1     17/1    1.07 GB   4.0     25.6    13.7     11.9      22.3     10.4       0.0   1.6    274.1    238.7     95.68             70.24        17    5.628     26M  3362K       0.0       0.0
  L2     94/2    4.51 GB   1.8     19.5     8.8     10.7      14.6      3.9       0.6   1.7    299.6    224.7     66.56             46.77       130    0.512     19M  4952K       0.0       0.0
 Sum    125/3    6.43 GB   0.0     45.1    22.5     22.5      51.5     29.0       0.6   3.5    230.7    263.6    200.12            143.07       387    0.517     45M  8314K       0.0       0.0
 Int      0/0    0.00 KB   0.0     44.8    22.3     22.5      50.8     28.3       0.6   3.6    231.2    262.2    198.57            141.78       379    0.524     45M  8310K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     45.1    22.5     22.5      36.9     14.4       0.0   0.0    284.5    232.9    162.24            117.01       147    1.104     45M  8314K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    394.7     37.88             26.06       240    0.158       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 166.0 total, 162.9 interval
Flush(GB): cumulative 14.598, interval 14.172
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 51.51 GB write, 317.82 MB/s write, 45.08 GB read, 278.16 MB/s read, 200.1 seconds
Interval compaction: 50.84 GB write, 319.51 MB/s write, 44.84 GB read, 281.77 MB/s read, 198.6 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 22, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 22, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 22, total-stops: 0
interval: 22 total count
Block cache LRUCache@0x55fb780f3df0#84313 capacity: 32.00 MB seed: 2053609329 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000174 secs_since: 165
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 166.0 total, 162.9 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 91.03 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 91.03 MB/s
Cumulative stall: 00:01:5.559 H:M:S, 39.5 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14621.90 MB, 89.74 MB/s
Interval WAL: 14M writes, 0 syncs, 14519101.00 writes per sync, written: 14.28 GB, 89.74 MB/s
Interval stall: 00:01:5.559 H:M:S, 40.2 percent
Write Stall (count): write-buffer-manager-limit-stops: 0